app/models/scraping_j.rb

      destination = tmp3.delete('}')
      n = n + 1
      opdtjoban = OpdtJoban.new(o_id: id, date: date, context: context, delay: delay,opdt_index: opdt_index,same_as: sameas,railway: railway, operator: operator, to_station: tostation, train_type: traintype, from_station: fromstation,train_number:trainnumber, direction: direction,composition: composition,destinantion_station: destination, o_valid: o_valid, o_type: o_type)
      opdtjoban.save
---
INSERT INTO `opdt_jobans` (`o_id`, `o_type`, `date`, `context`, `o_valid`, `delay`, `opdt_index`, `same_as`, `railway`, `operator`, `to_station`, `train_type`, `from_station`, `train_number`, `direction`, `composition`, `destinantion_station`, `created_at`, `updated_at`) VALUES ('9f72515c-1055-4315-87b-218553c57f6c', 'Train', '2018-12-03 12:26:35', 'http://vocab.odpt.org/context_odpt.jsonld', '2018-12-03 12:31:35', 0, 1, 'Train:JR-East.Joban.1159M', 'Joban', 'JR-East', 'Ishioka', 'JR-East.Local', 'Takahama', '1159M', 'Outbound', 5, 'Katsuta', '2018-12-03 03:30:02', '2018-12-03 03:30:02')