app/models/scraping_j.rb

      destination = tmp2.delete('}')
      n = n + 1
      opdtjoban = OpdtJoban.new(o_id: id, date: date, context: context, delay: delay,opdt_index: opdt_index,same_as: sameas,railway: railway, operator: operator, to_station: tostation, train_type: traintype, from_station: fromstation,train_number:trainnumber, direction: direction,composition: composition,destinantion_station: destination, o_valid: o_valid, o_type: o_type)
      opdtjoban.save
---
INSERT INTO `opdt_jobans` (`o_id`, `o_type`, `context`, `delay`, `opdt_index`, `same_as`, `railway`, `operator`, `to_station`, `train_type`, `from_station`, `train_number`, `direction`, `composition`, `destinantion_station`, `created_at`, `updated_at`) VALUES (' typeoptTa', ' dc:date\"=>\"2018-11-30T16:11:35+09:00\"', ' dct:valid=>\"2018-11-30T16:16:35+09:00\"', 0, 0, ' odpt:railway\"=>\"odpt.Railway:JR-East.Joban\"', ' odpt:operator\"=>\"odpt.Operator:JR-East\"', ' odpt:toStation\"=>\"odpt.Station:JR-East.Joban.Ishioka\"', ' odpt:trainType\"=>\"odpt.TrainType:JR-East.LimitedExpress\"', ' odpt:fromStation\"=>\"odpt.Station:JR-East.Joban.Hatori\"', ' odpt:trainNumber\"=>\"80M\"', 'lDc.RlDcI', ' odpt:carComposition\"=>10', 0, ' {@id=>urn:uuid:5f83384a-2d06-4ed9-a346-cbf513e86e44', '2018-11-30 07:15:04', '2018-11-30 07:15:04')