app/models/scraping_y.rb

INSERT INTO `opdt_yamanotes` (`o_id`, `o_type`, `date`, `context`, `o_valid`, `delay`, `opdt_index`, `same_as`, `railway`, `operator`, `to_station`, `train_type`, `from_station`, `train_number`, `direction`, `composition`, `destinantion_station`, `created_at`, `updated_at`) VALUES ('a8e6549a-0aec-4c46-9225-1a13c292360a', 'Train', '2018-11-29 20:07:36', 'http://vocab.odpt.org/context_odpt.jsonld', '2018-11-29 20:12:36', 360, 1, 'Train:JR-East.Yamanote.1943G', 'Yamanote', 'JR-East', ' odpt:toStation\"=>nil', 'JR-East.Local', 'Ueno', '1943G', 'OuterLoop', 11, 'Osaki', '2018-11-29 11:11:02', '2018-11-29 11:11:02')
---

      n = n + 1
      opdtyamanote = OpdtYamanote.new(o_id: id, date: date, context: context, delay: delay,opdt_index: opdt_index,same_as: sameas,railway: railway, operator: operator, to_station: tostation, train_type: traintype, from_station: fromstation,train_number:trainnumber, direction: direction,composition: composition,destinantion_station: destination, o_valid: o_valid, o_type: o_type)
      opdtyamanote.save