app/models/scraping_y.rb


      n = n + 1
      opdtyamanote = OpdtYamanote.new(o_id: id, date: date, context: context, delay: delay,opdt_index: opdt_index,same_as: sameas,railway: railway, operator: operator, to_station: tostation, train_type: traintype, from_station: fromstation,train_number:trainnumber, direction: direction,composition: composition,destinantion_station: destination, o_valid: o_valid, o_type: o_type)
      opdtyamanote.save
---
INSERT INTO `opdt_yamanotes` (`o_id`, `o_type`, `date`, `context`, `o_valid`, `delay`, `opdt_index`, `same_as`, `railway`, `operator`, `to_station`, `train_type`, `from_station`, `train_number`, `direction`, `composition`, `destinantion_station`, `created_at`, `updated_at`) VALUES ('68339fc-943a-48a-a42b-04c991e8fea1', 'Train', '2018-12-03 12:26:35', 'http://vocab.odpt.org/context_odpt.jsonld', '2018-12-03 12:31:35', 0, 1, 'Train:JR-East.Yamanote.1114G', 'Yamanote', 'JR-East', 'Meguro', 'JR-East.Local', 'Ebisu', '1114G', 'InnerLoop', 11, 'Osaki', '2018-12-03 03:30:02', '2018-12-03 03:30:02')